/*
  Localizable.strings (繁體中文)
  ClipArc

  Created by Adam Lyu on 2026-01-22.
*/

// MARK: - Common
"app.name" = "ClipArc";
"common.enable" = "啟用";
"common.disable" = "停用";
"common.cancel" = "取消";
"common.done" = "完成";
"common.save" = "儲存";
"common.delete" = "刪除";
"common.copy" = "複製";
"common.paste" = "貼上";
"common.search" = "搜尋";
"common.settings" = "設定";
"common.continue" = "繼續";
"common.skip" = "略過";
"common.skip_for_now" = "暫時略過";
"common.edit" = "編輯";
"common.select_all" = "全選";

// MARK: - Language
"language.system" = "跟隨系統";

// MARK: - Onboarding Welcome
"onboarding.welcome.title" = "歡迎使用 ClipArc";
"onboarding.welcome.subtitle" = "您的 macOS 智慧剪貼簿管理器";
"onboarding.welcome.get_started" = "開始使用";

// MARK: - Onboarding Features
"onboarding.feature.history.title" = "剪貼簿歷史";
"onboarding.feature.history.description" = "存取您複製過的所有內容";
"onboarding.feature.search.title" = "即時搜尋";
"onboarding.feature.search.description" = "秒速查找任何剪貼內容";
"onboarding.feature.hotkey.title" = "全域快捷鍵";
"onboarding.feature.hotkey.description" = "隨時隨地按 ⇧⌘V";

// MARK: - Onboarding Permissions
"onboarding.permissions.title" = "權限設定";
"onboarding.permissions.subtitle" = "ClipArc 需要一些權限才能正常運作";
"onboarding.permissions.accessibility.title" = "輔助使用";
"onboarding.permissions.accessibility.description" = "自動貼上內容所需";
"onboarding.permissions.launch_at_login.title" = "登入時啟動";
"onboarding.permissions.launch_at_login.description" = "自動啟動 ClipArc";

// MARK: - Onboarding Sign In
"onboarding.signin.title" = "登入";
"onboarding.signin.subtitle" = "使用 Apple 帳號登入以跨裝置同步";
"onboarding.signin.signed_in_as" = "已登入為";
"onboarding.signin.sign_in_later" = "您可以稍後在設定中登入";

// MARK: - Onboarding Subscription
"onboarding.subscription.title" = "釋放全部潛能";
"onboarding.subscription.subtitle" = "再也不會遺失複製的內容";
"onboarding.subscription.subscribe" = "訂閱";
"onboarding.subscription.start_free_trial" = "繼續使用免費版";
"onboarding.subscription.free_vs_pro" = "免費版: 5 筆紀錄 · 專業版: 無限";
"onboarding.subscription.you_are_pro" = "您已是專業版用戶！";
"onboarding.subscription.save_44" = "最超值";
"onboarding.subscription.benefit1" = "無限剪貼簿歷史紀錄";
"onboarding.subscription.benefit2" = "儲存文字、圖片和檔案";
"onboarding.subscription.benefit3" = "快速搜尋所有內容";
"onboarding.subscription.benefit4" = "隱私安全，本地儲存";

// MARK: - Onboarding Complete
"onboarding.complete.title" = "設定完成！";
"onboarding.complete.subtitle" = "ClipArc 已準備就緒";
"onboarding.complete.start_using" = "開始使用 ClipArc";
"onboarding.complete.tip.open" = "開啟剪貼簿歷史";
"onboarding.complete.tip.navigate" = "瀏覽項目";
"onboarding.complete.tip.paste" = "貼上選取項目";
"onboarding.complete.tip.close" = "關閉面板";

// MARK: - Settings
"settings.title" = "設定";
"settings.general" = "一般";
"settings.account" = "帳戶";
"settings.subscription" = "訂閱";
"settings.about" = "關於";

"settings.history_limit" = "歷史紀錄上限";
"settings.items" = "筆紀錄";
"settings.startup" = "啟動";
"settings.launch_at_login" = "登入時啟動";
"settings.show_in_dock" = "在 Dock 中顯示";
"settings.hotkey" = "快捷鍵";
"settings.global_hotkey" = "全域快捷鍵";
"settings.permissions" = "權限";
"settings.granted" = "已授權";
"settings.language" = "語言";
"settings.restart_required" = "重新啟動應用程式以套用語言變更";
"settings.appearance" = "外觀";
"settings.appearance.system" = "跟隨系統";
"settings.appearance.light" = "淺色";
"settings.appearance.dark" = "深色";

"settings.sign_out" = "登出";
"settings.sync_description" = "登入以跨裝置同步資料";
"settings.member_account" = "會員帳戶";
"settings.sign_in_description" = "登入以驗證會員身份";
"settings.account_linked" = "帳戶已連結";
"settings.benefit_membership" = "驗證專業版會員";
"settings.benefit_restore" = "輕鬆恢復購買";
"settings.benefit_multi_device" = "多裝置使用同一帳戶";
"settings.login_required" = "請先登入";
"settings.login_required_message" = "請先使用 Apple ID 登入後再訂閱。請前往「帳戶」頁面登入。";
"settings.go_to_account" = "好的";
"settings.accessibility_guide" = "系統設定 → 隱私權與安全性 → 輔助使用 → 啟用 ClipArc";

"settings.pro_badge" = "ClipArc 專業版";
"settings.lifetime_license" = "終身授權";
"settings.renews_on" = "續訂日期 %@";
"settings.manage_subscription" = "管理訂閱";
"settings.upgrade_to_pro" = "升級至專業版";
"settings.upgrade_description" = "取得無限剪貼簿歷史紀錄等更多功能";
"settings.restore_purchases" = "恢復購買";

"settings.version" = "版本";
"settings.about_description" = "一款快速簡潔的 macOS 剪貼簿管理器";
"settings.support" = "支援";
"settings.privacy" = "隱私";
"settings.terms" = "條款";

// MARK: - Clipboard
"clipboard.empty.title" = "尚無剪貼內容";
"clipboard.empty.subtitle" = "複製內容即可開始";
"clipboard.search.placeholder" = "搜尋剪貼內容...";
"clipboard.search.no_results" = "找不到結果";
"clipboard.copied" = "已複製";
"clipboard.pasted" = "已貼上";

"clipboard.type.all" = "全部";
"clipboard.type.frequent" = "常用";
"clipboard.type.text" = "文字";
"clipboard.type.image" = "圖片";
"clipboard.type.file" = "檔案";
"clipboard.type.link" = "連結";
"clipboard.delete_selected" = "刪除所選";

// MARK: - Menu Bar
"menu.show_panel" = "顯示 ClipArc";
"menu.preferences" = "偏好設定...";
"menu.clear_history" = "清除歷史";
"menu.about" = "關於 ClipArc";
"menu.help" = "幫助";
"menu.quit" = "結束 ClipArc";

// MARK: - Rating
"rating.title" = "喜歡 ClipArc 嗎？";
"rating.subtitle" = "您的回饋幫助我們改進";
"rating.yes_love_it" = "很喜歡！";
"rating.not_really" = "還不夠好";

// MARK: - Errors
"error.generic" = "發生錯誤，請重試。";
"error.auth_failed" = "認證失敗，請重試。";
"error.purchase_failed" = "購買失敗，請重試。";
"error.network" = "網路錯誤，請檢查您的連線。";

// MARK: - Time
"time.just_now" = "剛剛";
"time.minutes_ago" = "%d 分鐘前";
"time.hours_ago" = "%d 小時前";
"time.yesterday" = "昨天";
"time.days_ago" = "%d 天前";

// MARK: - Toast
"toast.running" = "正在背景執行";

"settings.storage" = "儲存空間";
"settings.cache_size" = "快取大小";
"settings.history_items" = "歷史記錄數";
"settings.clear_cache" = "清除快取";
"settings.clear_cache_message" = "這將刪除所有快取的圖片和縮圖。您的剪貼簿歷史記錄將被保留。";
"settings.clear_all_history" = "清除所有歷史";
"settings.clear_history_message" = "這將永久刪除所有剪貼簿歷史記錄。此操作無法撤銷。";
"settings.clear" = "清除";
